packages/python-postnl-checkout/python_postnl_checkout-0.1-py2-none-any.whl/postnl_checkout/tests/data/wsdl/WebshopCheckoutWebService_1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="WebshopCheckoutWebService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <wsdl:types>
    <xsd:schema targetNamespace="http://tempuri.org/Imports">
      <xsd:import schemaLocation="WebshopCheckoutWebService.xsd" namespace="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
      <xsd:import schemaLocation="WebshopCheckoutWebService_1_2.xsd" namespace="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
      <xsd:import schemaLocation="WebshopCheckoutWebService_1_2_3_4.xsd" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
      <xsd:import schemaLocation="WebshopCheckoutWebService_1.xsd" namespace="http://schemas.datacontract.org/2004/07/Tpp.Cif.Services.Domain.WebshopCheckoutWebService"/>
      <xsd:import schemaLocation="WebshopCheckoutWebService_1_2_3.xsd" namespace="http://schemas.datacontract.org/2004/07/Tpp.Cif.Services.Services.Exception"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="ConfirmOrderRequestContract">
    <wsdl:part name="ConfirmOrder" element="q1:ConfirmOrder" xmlns:q1="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="ConfirmOrderResponseContract">
    <wsdl:part name="ConfirmOrderResponse" element="q2:ConfirmOrderResponse" xmlns:q2="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_ConfirmOrder_CifExceptionFault_FaultMessage">
    <wsdl:part name="detail" element="q3:CifException" xmlns:q3="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
  </wsdl:message>
  <wsdl:message name="PrepareOrderRequestContract">
    <wsdl:part name="PrepareOrder" element="q4:PrepareOrder" xmlns:q4="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="PrepareOrderResponseContract">
    <wsdl:part name="PrepareOrderResponse" element="q5:PrepareOrderResponse" xmlns:q5="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_PrepareOrder_CifExceptionFault_FaultMessage">
    <wsdl:part name="detail" element="q6:CifException" xmlns:q6="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
  </wsdl:message>
  <wsdl:message name="ReadOrderRequestContract">
    <wsdl:part name="ReadOrder" element="q7:ReadOrder" xmlns:q7="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="ReadOrderResponseContract">
    <wsdl:part name="ReadOrderResponse" element="q8:ReadOrderResponse" xmlns:q8="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_ReadOrder_CifExceptionFault_FaultMessage">
    <wsdl:part name="detail" element="q9:CifException" xmlns:q9="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
  </wsdl:message>
  <wsdl:message name="UpdateOrderRequestContract">
    <wsdl:part name="UpdateOrder" element="q10:UpdateOrder" xmlns:q10="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="UpdateOrderResponseContract">
    <wsdl:part name="UpdateOrderResponse" element="q11:UpdateOrderResponse" xmlns:q11="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_UpdateOrder_CifExceptionFault_FaultMessage">
    <wsdl:part name="detail" element="q12:CifException" xmlns:q12="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_PingStatus_InputMessage"/>
  <wsdl:message name="PingStatusResponseContract">
    <wsdl:part name="PingStatusResponse" element="q13:PingStatusResponse" xmlns:q13="http://postnl.nl/cif/services/WebshopCheckoutWebService/"/>
  </wsdl:message>
  <wsdl:message name="IWebshopCheckoutWebService_PingStatus_CifExceptionFault_FaultMessage">
    <wsdl:part name="detail" element="q14:CifException" xmlns:q14="http://schemas.datacontract.org/2004/07/Tpp.Cif.WebServices.WebServices"/>
  </wsdl:message>
  <wsdl:portType name="IWebshopCheckoutWebService">
    <wsdl:operation name="ConfirmOrder">
      <wsdl:input wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ConfirmOrder" name="ConfirmOrderRequestContract" message="tns:ConfirmOrderRequestContract"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ConfirmOrderResponse" name="ConfirmOrderResponseContract" message="tns:ConfirmOrderResponseContract"/>
      <wsdl:fault wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ConfirmOrderCifExceptionFault" name="CifExceptionFault" message="tns:IWebshopCheckoutWebService_ConfirmOrder_CifExceptionFault_FaultMessage"/>
    </wsdl:operation>
    <wsdl:operation name="PrepareOrder">
      <wsdl:input wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PrepareOrder" name="PrepareOrderRequestContract" message="tns:PrepareOrderRequestContract"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PrepareOrderResponse" name="PrepareOrderResponseContract" message="tns:PrepareOrderResponseContract"/>
      <wsdl:fault wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PrepareOrderCifExceptionFault" name="CifExceptionFault" message="tns:IWebshopCheckoutWebService_PrepareOrder_CifExceptionFault_FaultMessage"/>
    </wsdl:operation>
    <wsdl:operation name="ReadOrder">
      <wsdl:input wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ReadOrder" name="ReadOrderRequestContract" message="tns:ReadOrderRequestContract"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ReadOrderResponse" name="ReadOrderResponseContract" message="tns:ReadOrderResponseContract"/>
      <wsdl:fault wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/ReadOrderCifExceptionFault" name="CifExceptionFault" message="tns:IWebshopCheckoutWebService_ReadOrder_CifExceptionFault_FaultMessage"/>
    </wsdl:operation>
    <wsdl:operation name="UpdateOrder">
      <wsdl:input wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/UpdateOrder" name="UpdateOrderRequestContract" message="tns:UpdateOrderRequestContract"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/UpdateOrderResponse" name="UpdateOrderResponseContract" message="tns:UpdateOrderResponseContract"/>
      <wsdl:fault wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/UpdateOrderCifExceptionFault" name="CifExceptionFault" message="tns:IWebshopCheckoutWebService_UpdateOrder_CifExceptionFault_FaultMessage"/>
    </wsdl:operation>
    <wsdl:operation name="PingStatus">
      <wsdl:input wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PingStatus" message="tns:IWebshopCheckoutWebService_PingStatus_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PingStatusResponse" name="PingStatusResponseContract" message="tns:PingStatusResponseContract"/>
      <wsdl:fault wsaw:Action="http://tempuri.org/IWebshopCheckoutWebService/PingStatusCifExceptionFault" name="CifExceptionFault" message="tns:IWebshopCheckoutWebService_PingStatus_CifExceptionFault_FaultMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IWebshopCheckoutWebService" type="tns:IWebshopCheckoutWebService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="ConfirmOrder">
      <soap:operation soapAction="http://tempuri.org/IWebshopCheckoutWebService/ConfirmOrder" style="document"/>
      <wsdl:input name="ConfirmOrderRequestContract">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="ConfirmOrderResponseContract">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="CifExceptionFault">
        <soap:fault name="CifExceptionFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="PrepareOrder">
      <soap:operation soapAction="http://tempuri.org/IWebshopCheckoutWebService/PrepareOrder" style="document"/>
      <wsdl:input name="PrepareOrderRequestContract">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="PrepareOrderResponseContract">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="CifExceptionFault">
        <soap:fault name="CifExceptionFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="ReadOrder">
      <soap:operation soapAction="http://tempuri.org/IWebshopCheckoutWebService/ReadOrder" style="document"/>
      <wsdl:input name="ReadOrderRequestContract">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="ReadOrderResponseContract">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="CifExceptionFault">
        <soap:fault name="CifExceptionFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="UpdateOrder">
      <soap:operation soapAction="http://tempuri.org/IWebshopCheckoutWebService/UpdateOrder" style="document"/>
      <wsdl:input name="UpdateOrderRequestContract">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="UpdateOrderResponseContract">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="CifExceptionFault">
        <soap:fault name="CifExceptionFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="PingStatus">
      <soap:operation soapAction="http://tempuri.org/IWebshopCheckoutWebService/PingStatus" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="PingStatusResponseContract">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="CifExceptionFault">
        <soap:fault name="CifExceptionFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="WebshopCheckoutWebService">
    <wsdl:port name="BasicHttpBinding_IWebshopCheckoutWebService" binding="tns:BasicHttpBinding_IWebshopCheckoutWebService">
      <soap:address location="https://testservice.postnl.com/CIF_SB/WebshopCheckoutWebService/2_0/WebshopCheckoutService.svc"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>