packages/python-postnl-checkout/python_postnl_checkout-0.1-py2-none-any.whl/postnl_checkout/tests/data/read_order_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns0="http://postnl.nl/cif/services/WebshopCheckoutWebService/" xmlns:ns1="http://schemas.datacontract.org/2004/07/Tpp.Cif.Services.Domain.WebshopCheckoutWebService" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security mustUnderstand="true"><wsse:UsernameToken><wsse:Username>klant1</wsse:Username><wsse:Password>dd7b7b74ea160e049dd128478e074ce47254bde8</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><ns2:Body><ns0:ReadOrder><ns1:Checkout><ns1:OrderToken>0cfb4be2-47cf-4eac-865c-d66657953d5c</ns1:OrderToken></ns1:Checkout><ns1:Webshop><ns1:IntRef>a0713e4083a049a996c302f48bb3f535</ns1:IntRef></ns1:Webshop></ns0:ReadOrder></ns2:Body></SOAP-ENV:Envelope>
