packages/python-postnl-checkout/python_postnl_checkout-0.1-py2-none-any.whl/postnl_checkout/tests/data/prepare_order_request.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns0="http://postnl.nl/cif/services/WebshopCheckoutWebService/" xmlns:ns1="http://schemas.datacontract.org/2004/07/Tpp.Cif.Services.Domain.WebshopCheckoutWebService" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security mustUnderstand="true"><wsse:UsernameToken><wsse:Username>klant1</wsse:Username><wsse:Password>dd7b7b74ea160e049dd128478e074ce47254bde8</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><ns2:Body><ns0:PrepareOrder><ns1:AangebodenBetaalMethoden><ns1:PrepareOrderBetaalMethode><ns1:Code>IDEAL</ns1:Code><ns1:Prijs>5.00</ns1:Prijs></ns1:PrepareOrderBetaalMethode></ns1:AangebodenBetaalMethoden><ns1:AangebodenCommunicatieOpties><ns1:PrepareOrderCommunicatieOptie><ns1:Code>NEWS</ns1:Code></ns1:PrepareOrderCommunicatieOptie></ns1:AangebodenCommunicatieOpties><ns1:Consument><ns1:ExtRef>test@e-id.nl</ns1:ExtRef></ns1:Consument><ns1:Contact><ns1:Url>http://www.kadowereld.nl/url/contact</ns1:Url></ns1:Contact><ns1:Order><ns1:ExtRef>1105_900</ns1:ExtRef><ns1:OrderDatum>21-07-2011 20:11:00</ns1:OrderDatum><ns1:Subtotaal>125.00</ns1:Subtotaal><ns1:VerzendDatum>22-07-2011 20:11:00</ns1:VerzendDatum><ns1:VerzendKosten>12.50</ns1:VerzendKosten></ns1:Order><ns1:Retour><ns1:BeschrijvingUrl>http://www.kadowereld.nl/url/beschrijving</ns1:BeschrijvingUrl><ns1:PolicyUrl>http://www.kadowereld.nl/url/policy</ns1:PolicyUrl><ns1:RetourTermijn>28</ns1:RetourTermijn><ns1:StartProcesUrl>http://www.kadowereld.nl/url/startproces</ns1:StartProcesUrl></ns1:Retour><ns1:Service><ns1:Url>http://www.kadowereld.nl/url/service</ns1:Url></ns1:Service><ns1:Webshop><ns1:IntRef>a0713e4083a049a996c302f48bb3f535</ns1:IntRef></ns1:Webshop></ns0:PrepareOrder></ns2:Body></SOAP-ENV:Envelope>
