packages/python-postnl-checkout/python-postnl-checkout-0.1.tar.gz/python-postnl-checkout-0.1/postnl_checkout/tests/data/update_order_request.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns0="http://postnl.nl/cif/services/WebshopCheckoutWebService/" xmlns:ns1="http://schemas.datacontract.org/2004/07/Tpp.Cif.Services.Domain.WebshopCheckoutWebService" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security mustUnderstand="true"><wsse:UsernameToken><wsse:Username>klant1</wsse:Username><wsse:Password>dd7b7b74ea160e049dd128478e074ce47254bde8</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><ns2:Body><ns0:UpdateOrder><ns1:Order><ns1:ExtRef>FDK004</ns1:ExtRef><ns1:Zending><ns1:UpdateOrderOrderZending><ns1:Busstuk><ns1:UpdateOrderOrderZendingBusstuk><ns1:Verzonden>23-08-2011 12:00:00</ns1:Verzonden></ns1:UpdateOrderOrderZendingBusstuk></ns1:Busstuk><ns1:ExtRef>642be996-6ab3-4a4c-b7d6-2417a4cee0df</ns1:ExtRef><ns1:Pakket><ns1:UpdateOrderOrderZendingPakket><ns1:Barcode>3s123456789</ns1:Barcode><ns1:Postcode>4131LV</ns1:Postcode></ns1:UpdateOrderOrderZendingPakket></ns1:Pakket></ns1:UpdateOrderOrderZending></ns1:Zending></ns1:Order><ns1:Webshop><ns1:IntRef>a0713e4083a049a996c302f48bb3f535</ns1:IntRef></ns1:Webshop></ns0:UpdateOrder></ns2:Body></SOAP-ENV:Envelope>
